Revit 2024 API
Connector.AssignedDuctFlowConfiguration Property
The assigned duct flow configuration of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public DuctFlowConfigurationType AssignedDuctFlowConfiguration { get; }
Visual Basic
Public ReadOnly Property AssignedDuctFlowConfiguration As DuctFlowConfigurationType
	Get
Visual C++
public:
property DuctFlowConfigurationType AssignedDuctFlowConfiguration {
	DuctFlowConfigurationType get ();
}
Remarks
Assigned duct flow configuration may be assigned for connectors of some family instances.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the connector's domain is not DomainHvac. Thrown when the connector is not in a family instance.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown on failure to get duct flow configuration.
See Also
Connector Class
Autodesk.Revit.DB Namespace